{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## import in graphdb using py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import neo4j\n",
    "import os\n",
    "#neo4jUrl = os.environ.get('NEO4J_URL',\"http://neo4j:secret@neo4j:7474/db/data/\")\n",
    "neo4jUrl = \"http://neo4j:secret@neo4j:7474/db/data/\"\n",
    "# Connect to graph\n",
    "graph = neo4j.Graph(neo4jUrl)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "mres= graph.cypher.execute(\"\"\"\n",
    "   MATCH (sc:SubCharacteristic)--(c:Characteristic)-[:BELONGS_TO]->(f:Family {uid:\"mMicrostructureFamily\"})\n",
    "   RETURN c.uid,sc.uid,sc.name\"\"\")\n",
    "cpres= graph.cypher.execute(\"\"\"\n",
    "   MATCH (sc:SubCharacteristic)--(c:Characteristic)-[:BELONGS_TO]->(f:Family {uid:\"cpriMicrostructureFamily\"})\n",
    "   RETURN c.uid,sc.uid,sc.name\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO 2018-05-04 16:30:55,141 core 13 139733259949824 begin\n",
      "INFO 2018-05-04 16:30:55,206 core 13 139733259949824 append u'\\n   MATCH (c:Characteristic)-[:BELONGS_TO]->(f:Family {uid:\"cpriMicrostructureFamily\"})\\n   RETURN c ORDER BY c.order' {}\n",
      "INFO 2018-05-04 16:30:55,212 core 13 139733259949824 commit\n",
      "INFO 2018-05-04 16:30:55,222 http 13 139733259949824 > POST http://neo4j:7474/db/data/transaction/commit [199]\n",
      "INFO 2018-05-04 16:30:55,243 http 13 139733259949824 ~ Reconnecting (peer closed connection)\n",
      "INFO 2018-05-04 16:30:55,261 http 13 139733259949824 > POST http://neo4j:7474/db/data/transaction/commit [199]\n",
      "INFO 2018-05-04 16:30:55,330 http 13 139733259949824 < 200 OK [15216]\n",
      "INFO 2018-05-04 16:30:55,374 core 13 139733259949824 result [u'c'] 11\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{uid:\"alternatingBandsCharacteristic\", name:\"alternating bands\", order:\"1\"},\n",
      "{uid:\"scatteredAggregateMicrostructureCharacteristic\", name:\"scattered aggregate microstructure\", order:\"9\"},\n",
      "{uid:\"structuralVoidCharacteristic\", name:\"structural void\", order:\"11\"},\n",
      "{uid:\"cristallineMicrostructureCharacteristic\", name:\"cristalline microstructure\", order:\"2\"},\n",
      "{uid:\"hexagonalNetworkCharacteristic\", name:\"hexagonal network\", order:\"5\"},\n",
      "{uid:\"isolatedAggregateMicrostructureCharacteristic\", name:\"isolated aggregate microstructure\", order:\"6\"},\n",
      "{uid:\"lenticularCharacteristic\", name:\"lenticular\", order:\"7\"},\n",
      "{uid:\"noMicrostructureCharacteristic\", name:\"no microstructure\", order:\"8\"},\n",
      "{uid:\"pseudomorphOfDendriticCharacteristic\", name:\"pseudomorph of dendritic microstructure\", order:\"3\"},\n",
      "{uid:\"pseudomorphOfGranularCharacteristic\", name:\"pseudomorph of granular microstructure\", order:\"4\"},\n",
      "{uid:\"pseudomorphOfOrganicMaterialCharacteristic\", name:\"pseudomorph of organic material\", order:\"9\"},\n"
     ]
    }
   ],
   "source": [
    "cpres= graph.cypher.execute(\"\"\"\n",
    "   MATCH (c:Characteristic)-[:BELONGS_TO]->(f:Family {uid:\"cpriMicrostructureFamily\"})\n",
    "   RETURN c ORDER BY c.order\"\"\")\n",
    "\n",
    "for r in cpres:\n",
    "    #print r['c']['uid'],r['c']['name'],r['c']['order']\n",
    "    st='{{uid:\"{}\", name:\"{}\", order:\"{}\"}},'.format(r['c']['uid'], r['c']['name'], r['c']['order'])\n",
    "    print st"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "u'alternatingBandsCharacteristic'"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r['c']['uid']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "u'lenticularCharacteristic'"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r['c']['uid']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "twinLinesDeformedDendritic twin Lines Deformed Dendritic\n",
      "slipLinesDeformedDendritic slip Lines Deformed Dendritic\n",
      "inclusionsDeformedDendritic inclusions Deformed Dendritic\n",
      "eutecticPhaseDeformedDendritic eutectic Phase Deformed Dendritic\n",
      "inclusionsGrainElongated inclusions Grain Elongated\n",
      "slipLinesGrainElongated slip Lines Grain Elongated\n",
      "twinLinesGrainElongated twin Lines Grain Elongated\n",
      "eutecticPhaseGrainElongated eutectic Phase Grain Elongated\n",
      "eutecticPhaseGrainSmall eutectic Phase Grain Small\n",
      "twinLinesGrainSmall twin Lines Grain Small\n",
      "slipLinesGrainSmall slip Lines Grain Small\n",
      "inclusionsGrainSmall inclusions Grain Small\n",
      "inclusionsGrainLarge inclusions Grain Large\n",
      "slipLinesGrainLarge slip Lines Grain Large\n",
      "twinLinesGrainLarge twin Lines Grain Large\n",
      "eutecticPhaseGrainLarge eutectic Phase Grain Large\n",
      "inclusionsDendritic inclusions Dendritic\n",
      "slipLinesDendritic slip Lines Dendritic\n",
      "twinLinesDendritic twin Lines Dendritic\n",
      "eutecticPhaseDendritic eutectic Phase Dendritic\n"
     ]
    }
   ],
   "source": [
    "for r in res:\n",
    "    print r[\"sc.uid\"],r[\"sc.name\"]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "mjson = json.dumps([ {\"uid\":r[\"sc.uid\"],\"name\":r[\"sc.name\"]} for r in mres], indent=2)\n",
    "cpjson = json.dumps([ {\"uid\":r[\"sc.uid\"],\"name\":r[\"sc.name\"]} for r in cpres], indent=2)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[\n",
      "  {\n",
      "    \"uid\": \"twinLinesPseudomorphOfGranularCpri\", \n",
      "    \"name\": \"twin Lines Pseudomorph Of Granular\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesPseudomorphOfGranularCpri\", \n",
      "    \"name\": \"slip Lines Pseudomorph Of Granular\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsPseudomorphOfGranularCpri\", \n",
      "    \"name\": \"inclusions Pseudomorph Of Granular\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhasePseudomorphOfGranularCpri\", \n",
      "    \"name\": \"eutectic Phase Pseudomorph Of Granular\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesPseudomorphOfDendriticCpri\", \n",
      "    \"name\": \"twin Lines Pseudomorph Of Dendritic\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesPseudomorphOfDendriticCpri\", \n",
      "    \"name\": \"slip Lines Pseudomorph Of Dendritic\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsPseudomorphOfDendriticCpri\", \n",
      "    \"name\": \"inclusions Pseudomorph Of Dendritic\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhasePseudomorphOfDendriticCpri\", \n",
      "    \"name\": \"eutectic Phase Pseudomorph Of Dendritic\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesHexagonalNetworkCpri\", \n",
      "    \"name\": \"twin Lines Hexagonal Network\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesHexagonalNetworkCpri\", \n",
      "    \"name\": \"slip Lines Hexagonal Network\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsHexagonalNetworkCpri\", \n",
      "    \"name\": \"inclusions Hexagonal Network\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseHexagonalNetworkCpri\", \n",
      "    \"name\": \"eutectic Phase Hexagonal Network\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesAlternatingBandsCpri\", \n",
      "    \"name\": \"twin Lines Alternating Bands\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesAlternatingBandsCpri\", \n",
      "    \"name\": \"slip Lines Alternating Bands\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsAlternatingBandsCpri\", \n",
      "    \"name\": \"inclusions Alternating Bands\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseAlternatingBandsCpri\", \n",
      "    \"name\": \"eutectic Phase Alternating Bands\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesScatteredAggregateMicrostructureCpri\", \n",
      "    \"name\": \"twin Lines Scattered Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesScatteredAggregateMicrostructureCpri\", \n",
      "    \"name\": \"slip Lines Scattered Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsScatteredAggregateMicrostructureCpri\", \n",
      "    \"name\": \"inclusions Scattered Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseScatteredAggregateMicrostructureCpri\", \n",
      "    \"name\": \"eutectic Phase Scattered Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesIsolatedAggregateMicrostructureCpri\", \n",
      "    \"name\": \"twin Lines Isolated Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesIsolatedAggregateMicrostructureCpri\", \n",
      "    \"name\": \"slip Lines Isolated Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsIsolatedAggregateMicrostructureCpri\", \n",
      "    \"name\": \"inclusions Isolated Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseIsolatedAggregateMicrostructureCpri\", \n",
      "    \"name\": \"eutectic Phase Isolated Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesCristallineMicrostructureCpri\", \n",
      "    \"name\": \"twin Lines Cristalline Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesCristallineMicrostructureCpri\", \n",
      "    \"name\": \"slip Lines Cristalline Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsCristallineMicrostructureCpri\", \n",
      "    \"name\": \"inclusions Cristalline Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseCristallineMicrostructureCpri\", \n",
      "    \"name\": \"eutectic Phase Cristalline Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseNoMicrostructureCpri\", \n",
      "    \"name\": \"eutectic Phase No Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsNoMicrostructureCpri\", \n",
      "    \"name\": \"inclusions No Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesNoMicrostructureCpri\", \n",
      "    \"name\": \"slip Lines No Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesNoMicrostructureCpri\", \n",
      "    \"name\": \"twin Lines No Microstructure\"\n",
      "  }\n",
      "]\n"
     ]
    }
   ],
   "source": [
    "print cpjson"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO 2018-05-04 14:26:18,434 core 13 139733259949824 begin\n",
      "INFO 2018-05-04 14:26:18,462 core 13 139733259949824 append u'\\n   MATCH (c:Characteristic)-[:BELONGS_TO]->(f:Family {uid:\"cmLevelOfCorrosionFamily\"})\\n   MATCH (artefact:Artefact)-[:IS_REPRESENTED_BY]->(stratigraphy:Stratigraphy)-[:POSSESSES]->(strata:Strata)-[:IS_CONSTITUTED_BY]->(c)\\n   RETURN artefact.uid,stratigraphy.uid,strata.uid, c.uid,artefact.artefact_id' {}\n",
      "INFO 2018-05-04 14:26:18,463 core 13 139733259949824 commit\n",
      "INFO 2018-05-04 14:26:18,466 http 13 139733259949824 > POST http://neo4j:7474/db/data/transaction/commit [385]\n",
      "INFO 2018-05-04 14:26:18,471 http 13 139733259949824 ~ Reconnecting (peer closed connection)\n",
      "INFO 2018-05-04 14:26:18,476 http 13 139733259949824 > POST http://neo4j:7474/db/data/transaction/commit [385]\n",
      "INFO 2018-05-04 14:26:18,550 http 13 139733259949824 < 200 OK [819]\n",
      "INFO 2018-05-04 14:26:18,555 core 13 139733259949824 result [u'artefact.uid', u'stratigraphy.uid', u'strata.uid', u'c.uid', u'artefact.artefact_id'] 7\n"
     ]
    }
   ],
   "source": [
    "res= graph.cypher.execute(\"\"\"\n",
    "   MATCH (c:Characteristic)-[:BELONGS_TO]->(f:Family {uid:\"cmLevelOfCorrosionFamily\"})\n",
    "   MATCH (artefact:Artefact)-[:IS_REPRESENTED_BY]->(stratigraphy:Stratigraphy)-[:POSSESSES]->(strata:Strata)-[:IS_CONSTITUTED_BY]->(c)\n",
    "   RETURN artefact.uid,stratigraphy.uid,strata.uid, c.uid,artefact.artefact_id\"\"\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {
    "collapsed": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "artefact7 43\n",
      "Tang fragment of a knife with lake and terrestrial crust\n",
      "\n",
      "artefact3 39\n",
      "Curved pin or tang\n",
      "\n",
      "artefact7 43\n",
      "Tang fragment of a knife with lake and terrestrial crust\n",
      "\n",
      "artefact15 48\n",
      "Bed structure\n",
      "\n",
      "artefact11 47\n",
      "Sheet fragment with dark green / grey patina\n",
      "\n",
      "artefact15 48\n",
      "Bed structure\n",
      "\n",
      "artefact3 39\n",
      "Curved pin or tang\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for r in res:\n",
    "    print r['artefact.uid'],r['artefact.artefact_id']\n",
    "    a= Artefact.objects.get(pk=r['artefact.artefact_id'])\n",
    "    print a.object.name\n",
    "    print"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO 2018-05-04 16:52:10,184 core 13 139733259949824 begin\n",
      "INFO 2018-05-04 16:52:10,185 core 13 139733259949824 append u'\\nMATCH (c:Characteristic)-[:BELONGS_TO]->(f:Family {uid:\"cpriMicrostructureFamily\"})\\nWHERE c.uid<>\"scatteredAggregateMicrostructureCharacteristic\" AND c.uid <> \"isolatedAggregateMicrostructureCharacteristic\" and c.uid <> \"alternatingBandsCharacteristic\"\\nOPTIONAL MATCH (c)--(sc:SubCharacteristic)<-[:IS_CONSTITUTED_BY]-(s)<--(sgpy:Stratigraphy)<-[:IS_REPRESENTED_BY]-(artefact:Artefact)\\n   RETURN c,sc,s,sgpy,artefact ORDER BY c.order' {}\n",
      "INFO 2018-05-04 16:52:10,187 core 13 139733259949824 commit\n",
      "INFO 2018-05-04 16:52:10,188 http 13 139733259949824 > POST http://neo4j:7474/db/data/transaction/commit [525]\n",
      "INFO 2018-05-04 16:52:10,193 http 13 139733259949824 ~ Reconnecting (peer closed connection)\n",
      "INFO 2018-05-04 16:52:10,218 http 13 139733259949824 > POST http://neo4j:7474/db/data/transaction/commit [525]\n",
      "INFO 2018-05-04 16:52:10,319 http 13 139733259949824 < 200 OK [chunked]\n",
      "INFO 2018-05-04 16:52:10,355 core 13 139733259949824 result [u'c', u'sc', u's', u'sgpy', u'artefact'] 22\n"
     ]
    }
   ],
   "source": [
    "res = graph.cypher.execute(\"\"\"\n",
    "MATCH (c:Characteristic)-[:BELONGS_TO]->(f:Family {uid:\"cpriMicrostructureFamily\"})\n",
    "WHERE c.uid<>\"scatteredAggregateMicrostructureCharacteristic\" AND c.uid <> \"isolatedAggregateMicrostructureCharacteristic\" and c.uid <> \"alternatingBandsCharacteristic\"\n",
    "OPTIONAL MATCH (c)--(sc:SubCharacteristic)<-[:IS_CONSTITUTED_BY]-(s)<--(sgpy:Stratigraphy)<-[:IS_REPRESENTED_BY]-(artefact:Artefact)\n",
    "   RETURN c,sc,s,sgpy,artefact ORDER BY c.order\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "twinLinesCristallineMicrostructureCpri (n907:Artefact {date:\"2016-02-25\",label:\"artefact\",uid:\"Search\"})\n",
      "25c57e44-289c-11e6-be2d-000c29148083_Strata3 25c57e44-289c-11e6-be2d-000c29148083\n",
      "\n",
      "twinLinesCristallineMicrostructureCpri (n649:Artefact {artefact_id:39,id:30,uid:\"artefact3\"})\n",
      "strata304 stratigraphy30\n",
      "Curved pin or tang\n",
      "\n",
      "slipLinesCristallineMicrostructureCpri (n907:Artefact {date:\"2016-02-25\",label:\"artefact\",uid:\"Search\"})\n",
      "3a0dd7e6-4e18-11e7-a0ea-000c29a72d3e_Strata4 3a0dd7e6-4e18-11e7-a0ea-000c29a72d3e\n",
      "\n",
      "slipLinesCristallineMicrostructureCpri (n907:Artefact {date:\"2016-02-25\",label:\"artefact\",uid:\"Search\"})\n",
      "4133e766-28af-11e6-9a35-000c29148083_Strata1 4133e766-28af-11e6-9a35-000c29148083\n",
      "\n",
      "inclusionsCristallineMicrostructureCpri (n907:Artefact {date:\"2016-02-25\",label:\"artefact\",uid:\"Search\"})\n",
      "3a0dd7e6-4e18-11e7-a0ea-000c29a72d3e_Strata4 3a0dd7e6-4e18-11e7-a0ea-000c29a72d3e\n",
      "\n",
      "inclusionsCristallineMicrostructureCpri (n840:Artefact {date:\"2015-12-03\",label:\"artefact\",uid:\"artefact0412\"})\n",
      "artefact0412_stratigraphy2_Strata1 artefact0412_stratigraphy2\n",
      "\n",
      "None None\n",
      "None None\n",
      "\n",
      "None None\n",
      "None None\n",
      "\n",
      "None None\n",
      "None None\n",
      "\n",
      "inclusionsPseudomorphOfDendriticCpri (n907:Artefact {date:\"2016-02-25\",label:\"artefact\",uid:\"Search\"})\n",
      "c6afc0ce-2579-11e6-a9ce-000c29148083_Strata2 c6afc0ce-2579-11e6-a9ce-000c29148083\n",
      "\n",
      "inclusionsPseudomorphOfDendriticCpri (n609:Artefact {artefact_id:44,id:8,uid:\"artefact8\"})\n",
      "stratigraphy8a_Strata2 stratigraphy8a\n",
      "Bracelet with a dense, black lake patina\n",
      "\n",
      "eutecticPhasePseudomorphOfDendriticCpri (n907:Artefact {date:\"2016-02-25\",label:\"artefact\",uid:\"Search\"})\n",
      "e07383de-3ed2-11e6-a4c5-000c29148083_Strata4 e07383de-3ed2-11e6-a4c5-000c29148083\n",
      "\n",
      "eutecticPhasePseudomorphOfDendriticCpri (n907:Artefact {date:\"2016-02-25\",label:\"artefact\",uid:\"Search\"})\n",
      "e07383de-3ed2-11e6-a4c5-000c29148083_Strata3 e07383de-3ed2-11e6-a4c5-000c29148083\n",
      "\n",
      "eutecticPhasePseudomorphOfDendriticCpri (n907:Artefact {date:\"2016-02-25\",label:\"artefact\",uid:\"Search\"})\n",
      "c6afc0ce-2579-11e6-a9ce-000c29148083_Strata2 c6afc0ce-2579-11e6-a9ce-000c29148083\n",
      "\n",
      "eutecticPhasePseudomorphOfDendriticCpri (n907:Artefact {date:\"2016-02-25\",label:\"artefact\",uid:\"Search\"})\n",
      "3a0dd7e6-4e18-11e7-a0ea-000c29a72d3e_Strata4 3a0dd7e6-4e18-11e7-a0ea-000c29a72d3e\n",
      "\n",
      "eutecticPhasePseudomorphOfDendriticCpri (n907:Artefact {date:\"2016-02-25\",label:\"artefact\",uid:\"Search\"})\n",
      "43d63a54-3ec2-11e6-9c51-000c29148083_Strata2 43d63a54-3ec2-11e6-9c51-000c29148083\n",
      "\n",
      "eutecticPhasePseudomorphOfDendriticCpri (n840:Artefact {date:\"2015-12-03\",label:\"artefact\",uid:\"artefact0412\"})\n",
      "artefact0412_stratigraphy2_Strata1 artefact0412_stratigraphy2\n",
      "\n",
      "eutecticPhasePseudomorphOfDendriticCpri (n609:Artefact {artefact_id:44,id:8,uid:\"artefact8\"})\n",
      "stratigraphy8a_Strata2 stratigraphy8a\n",
      "Bracelet with a dense, black lake patina\n",
      "\n",
      "eutecticPhasePseudomorphOfDendriticCpri (n609:Artefact {artefact_id:44,id:8,uid:\"artefact8\"})\n",
      "strata82 stratigraphy8\n",
      "Bracelet with a dense, black lake patina\n",
      "\n",
      "None None\n",
      "None None\n",
      "\n",
      "None None\n",
      "None None\n",
      "\n",
      "None None\n",
      "None None\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for r in res:\n",
    "    print r['sc']['uid'] if r['sc'] else None,r['artefact']\n",
    "    print r['s']['uid'] if r['s'] else None, r['sgpy']['uid'] if r['sgpy'] else None\n",
    "    if r['artefact'] and r['artefact']['artefact_id']:\n",
    "        a= Artefact.objects.get(pk=r['artefact']['artefact_id'])\n",
    "        print a.object.name\n",
    "    print"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Django Shell-Plus",
   "language": "python",
   "name": "django_extensions"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
