{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## import in graphdb using py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import neo4j\n",
    "import os\n",
    "#neo4jUrl = os.environ.get('NEO4J_URL',\"http://neo4j:secret@neo4j:7474/db/data/\")\n",
    "neo4jUrl = \"http://neo4j:secret@neo4j:7474/db/data/\"\n",
    "# Connect to graph\n",
    "graph = neo4j.Graph(neo4jUrl)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "mres= graph.cypher.execute(\"\"\"\n",
    "   MATCH (sc:SubCharacteristic)--(c:Characteristic)-[:BELONGS_TO]->(f:Family {uid:\"mMicrostructureFamily\"})\n",
    "   RETURN c.uid,sc.uid,sc.name\"\"\")\n",
    "cpres= graph.cypher.execute(\"\"\"\n",
    "   MATCH (sc:SubCharacteristic)--(c:Characteristic)-[:BELONGS_TO]->(f:Family {uid:\"cpriMicrostructureFamily\"})\n",
    "   RETURN c.uid,sc.uid,sc.name\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "twinLinesDeformedDendritic twin Lines Deformed Dendritic\n",
      "slipLinesDeformedDendritic slip Lines Deformed Dendritic\n",
      "inclusionsDeformedDendritic inclusions Deformed Dendritic\n",
      "eutecticPhaseDeformedDendritic eutectic Phase Deformed Dendritic\n",
      "inclusionsGrainElongated inclusions Grain Elongated\n",
      "slipLinesGrainElongated slip Lines Grain Elongated\n",
      "twinLinesGrainElongated twin Lines Grain Elongated\n",
      "eutecticPhaseGrainElongated eutectic Phase Grain Elongated\n",
      "eutecticPhaseGrainSmall eutectic Phase Grain Small\n",
      "twinLinesGrainSmall twin Lines Grain Small\n",
      "slipLinesGrainSmall slip Lines Grain Small\n",
      "inclusionsGrainSmall inclusions Grain Small\n",
      "inclusionsGrainLarge inclusions Grain Large\n",
      "slipLinesGrainLarge slip Lines Grain Large\n",
      "twinLinesGrainLarge twin Lines Grain Large\n",
      "eutecticPhaseGrainLarge eutectic Phase Grain Large\n",
      "inclusionsDendritic inclusions Dendritic\n",
      "slipLinesDendritic slip Lines Dendritic\n",
      "twinLinesDendritic twin Lines Dendritic\n",
      "eutecticPhaseDendritic eutectic Phase Dendritic\n"
     ]
    }
   ],
   "source": [
    "for r in res:\n",
    "    print r[\"sc.uid\"],r[\"sc.name\"]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "mjson = json.dumps([ {\"uid\":r[\"sc.uid\"],\"name\":r[\"sc.name\"]} for r in mres], indent=2)\n",
    "cpjson = json.dumps([ {\"uid\":r[\"sc.uid\"],\"name\":r[\"sc.name\"]} for r in cpres], indent=2)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[\n",
      "  {\n",
      "    \"uid\": \"twinLinesPseudomorphOfGranularCpri\", \n",
      "    \"name\": \"twin Lines Pseudomorph Of Granular\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesPseudomorphOfGranularCpri\", \n",
      "    \"name\": \"slip Lines Pseudomorph Of Granular\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsPseudomorphOfGranularCpri\", \n",
      "    \"name\": \"inclusions Pseudomorph Of Granular\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhasePseudomorphOfGranularCpri\", \n",
      "    \"name\": \"eutectic Phase Pseudomorph Of Granular\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesPseudomorphOfDendriticCpri\", \n",
      "    \"name\": \"twin Lines Pseudomorph Of Dendritic\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesPseudomorphOfDendriticCpri\", \n",
      "    \"name\": \"slip Lines Pseudomorph Of Dendritic\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsPseudomorphOfDendriticCpri\", \n",
      "    \"name\": \"inclusions Pseudomorph Of Dendritic\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhasePseudomorphOfDendriticCpri\", \n",
      "    \"name\": \"eutectic Phase Pseudomorph Of Dendritic\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesHexagonalNetworkCpri\", \n",
      "    \"name\": \"twin Lines Hexagonal Network\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesHexagonalNetworkCpri\", \n",
      "    \"name\": \"slip Lines Hexagonal Network\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsHexagonalNetworkCpri\", \n",
      "    \"name\": \"inclusions Hexagonal Network\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseHexagonalNetworkCpri\", \n",
      "    \"name\": \"eutectic Phase Hexagonal Network\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesAlternatingBandsCpri\", \n",
      "    \"name\": \"twin Lines Alternating Bands\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesAlternatingBandsCpri\", \n",
      "    \"name\": \"slip Lines Alternating Bands\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsAlternatingBandsCpri\", \n",
      "    \"name\": \"inclusions Alternating Bands\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseAlternatingBandsCpri\", \n",
      "    \"name\": \"eutectic Phase Alternating Bands\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesScatteredAggregateMicrostructureCpri\", \n",
      "    \"name\": \"twin Lines Scattered Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesScatteredAggregateMicrostructureCpri\", \n",
      "    \"name\": \"slip Lines Scattered Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsScatteredAggregateMicrostructureCpri\", \n",
      "    \"name\": \"inclusions Scattered Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseScatteredAggregateMicrostructureCpri\", \n",
      "    \"name\": \"eutectic Phase Scattered Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesIsolatedAggregateMicrostructureCpri\", \n",
      "    \"name\": \"twin Lines Isolated Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesIsolatedAggregateMicrostructureCpri\", \n",
      "    \"name\": \"slip Lines Isolated Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsIsolatedAggregateMicrostructureCpri\", \n",
      "    \"name\": \"inclusions Isolated Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseIsolatedAggregateMicrostructureCpri\", \n",
      "    \"name\": \"eutectic Phase Isolated Aggregate Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesCristallineMicrostructureCpri\", \n",
      "    \"name\": \"twin Lines Cristalline Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesCristallineMicrostructureCpri\", \n",
      "    \"name\": \"slip Lines Cristalline Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsCristallineMicrostructureCpri\", \n",
      "    \"name\": \"inclusions Cristalline Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseCristallineMicrostructureCpri\", \n",
      "    \"name\": \"eutectic Phase Cristalline Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"eutecticPhaseNoMicrostructureCpri\", \n",
      "    \"name\": \"eutectic Phase No Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"inclusionsNoMicrostructureCpri\", \n",
      "    \"name\": \"inclusions No Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"slipLinesNoMicrostructureCpri\", \n",
      "    \"name\": \"slip Lines No Microstructure\"\n",
      "  }, \n",
      "  {\n",
      "    \"uid\": \"twinLinesNoMicrostructureCpri\", \n",
      "    \"name\": \"twin Lines No Microstructure\"\n",
      "  }\n",
      "]\n"
     ]
    }
   ],
   "source": [
    "print cpjson"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Django Shell-Plus",
   "language": "python",
   "name": "django_extensions"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
